{
  "users": [
    {
      "id": 1,
      "username": "largo",
      "email": "largo@holodilnik.com",
      "password": "123"
    }
  ],
  "recipes": [
    {
      "id": 1,
      "dishName": "Сырники из творога",
      "portionsNumber": 2,
      "shortDescription": "Главный секрет идеальных сырников — а точнее творожников, — творог нужно протереть через мелкое сито и отжать от влаги. Жирность предпочтительна не больше и не меньше 9%. Тесто должно получиться эластичным, чтобы при надавливании сырник не треснул на сковородке, а сохранил форму. Если все сделать правильно, получатся нежные однородные кругляшки под плотной румяной корочкой. Сырники можно запекать в духовке или готовить на пару. В рецепте не исключаются эксперименты с начинкой — сухофрукты, орехи, свежие фрукты и даже картофель лишними не будут.",
      "cookingTime": "PT30M",
      "ingredients": [
        {
          "name": "Творог",
          "weight": 500,
          "measure": "g"
        },
        {
          "name": "Яйцо куриное",
          "weight": 2,
          "measure": "piece"
        },
        {
          "name": "Пшеничная мука",
          "weight": 2,
          "measure": "spoon"
        },
        {
          "name": "Сахар",
          "weight": 5,
          "measure": "spoon"
        }
      ],
      "description": "Положите весь творог в кастрюльку и разомните его вилкой так, чтобы в нем не осталось крупных комков. Разбейте в него яйца, всыпьте сахар и тщательно все перемешайте. Лучше не использовать слишком сухой или слишком влажный творог, иначе сырники будут разваливаться в процессе приготовления.Всыпьте в творог 5 столовых ложек (с горкой) муки и тщательно перемешайте. Можно добавить немного больше муки, сырники получатся тогда более плотными. Или муки можно добавить чуть меньше, и тогда сырники будут нежнее. В итоге у вас должна получиться однородная масса, из которой можно будет лепить сырники.Поставьте сковороду на средний огонь и налейте в нее подсолнечное масло.Насыпьте на тарелку немного муки. Слепите несколько небольших шариков из получившейся творожной массы и положите их на тарелку. Лучше лепить разом 4–5 шариков — столько, сколько поместится одновременно на сковороду. Затем по очереди обкатывайте творожные шарики в муке, плющите их в небольшие лепешки (они не должны быть слишком тонкие) и выкладывайте на сковороду.Обжаривайте сырники 1–2 минуты до появления золотистой корочки. Затем переверните их на другую сторону и также обжарьте до золотистого состояния.Повторяйте, пока творог не закончится."
    },
    {
      "id": 2,
      "dishName": "Сырный суп по-французски с курицей",
      "portionsNumber": 4,
      "shortDescription": "Сырный суп по-французски с курицей",
      "cookingTime": "PT1H",
      "ingredients": [
        {
          "name": "Куриное филе",
          "weight": 500,
          "measure": "g"
        },
        {
          "name": "Плавленый сыр",
          "weight": 200,
          "measure": "g"
        },
        {
          "name": "Картофель",
          "weight": 400,
          "measure": "g"
        },
        {
          "name": "Лук",
          "weight": 150,
          "measure": "g"
        },
        {
          "name": "Морковь",
          "weight": 180,
          "measure": "g"
        },
        {
          "name": "Сливочное масло",
          "weight": 0,
          "measure": "to taste"
        },
        {
          "name": "Соль",
          "weight": 0,
          "measure": "to taste"
        },
        {
          "name": "Зелень",
          "weight": 0,
          "measure": "to taste"
        },
        {
          "name": "Гренки",
          "weight": 0,
          "measure": "to taste"
        },
        {
          "name": "Лавровый лист",
          "weight": 2,
          "measure": "piece"
        },
        {
          "name": "Черный перец горошком",
          "weight": 2,
          "measure": "piece"
        },
        {
          "name": "Перец черный молотый",
          "weight": 0,
          "measure": "to taste"
        }
      ],
      "description": "В кастрюлю на 3 литра положить мясо и налить воды. Как только бульон начнет кипеть, добавить 1 чайную ложку соли, пару горошков душистого перца и черного, 2–3 листика лаврового листа. Варить от момента закипания 20 минут. Затем мясо вынуть. Картофель почистить и нарезать кубиками. Лук нарезать кубиками. Морковь натереть на терке. Мясо порезать небольшими кусочками. Плавленый сыр (если в виде брусочка) натереть на терке или порезать кубиками."
    },
    {
      "id": 3,
      "dishName": "Классическая шарлотка",
      "portionsNumber": 12,
      "shortDescription": "Классическая шарлотка. Важное сладкое блюдо советской и постсоветской истории. Легкое, пышное тесто, максимум яблочной начинки — у шарлотки всегда был образ приятного, простого и при этом лакомого и диетического блюда. Яблоки настоятельно рекомендуем взять из кислых сортов — вроде антоновки. Их можно класть как сырыми, так и предварительно слегка карамелизованными на сковородке. И сахара лучше не жалеть. Он магическим образом распределяется в нужном количестве в тесте, а излишки образуют сладкую корочку.",
      "cookingTime": "PT35M",
      "ingredients": [
        {
          "name": "Сахар",
          "weight": 1,
          "measure": "glass"
        },
        {
          "name": "Яйцо куриное",
          "weight": 5,
          "measure": "piece"
        },
        {
          "name": "Пшеничная мука",
          "weight": 1,
          "measure": "glass"
        },
        {
          "name": "Яблоко",
          "weight": 5,
          "measure": "piece"
        },
        {
          "name": "Растительное масло",
          "weight": 1,
          "measure": "spoon"
        },
        {
          "name": "Сода",
          "weight": 0.5,
          "measure": "tsp."
        }
      ],
      "description": "Разогреть духовку. Отделить белки от желтков. Белки взбить в крепкую пену, постепенно добавляя сахар.Продолжать взбивать, добавляя по одному желтки, затем гашеную соду и муку. Тесто по консистенции должно напоминать сметану.Смазать противень растительным маслом. Вылить половину теста на противень, разложить равномерно нарезанные дольками яблоки, залить второй половиной теста.оместить противень в разогретую духовку. 3 минуты подержать при температуре 200 градусов, затем убавить до 180 и выпекать 20-25 минут."
    }
  ]
}